<a href="https://colab.research.google.com/github/siralexiss/git-prueba/blob/master/Leer_archivos_XLS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Leer archivos XLS

In [1]:
import pandas as pd

In [2]:
data=pd.read_excel("titanic3.xls","titanic3")

In [3]:
data.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [8]:
data.to_csv("titanic3.csv")#normalmente ahi iria la ubicacion donde queremos guardar el archivo y el nombre a guardar

In [9]:
data.to_html("prueba_titanic_html")